madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	return 0;
}























float targets[10];
const struct device *i2c_dev = DEVICE_DT_GET(DT_NODELABEL(i2c1));
int targets_count = 0;

uint8_t last_tracked = 0;
uint8_t last_in_fix = 0;
uint8_t last_unhealthy = 0;

uint8_t gps_tracking = 0;
uint8_t gps_using = 0;
uint8_t gps_unk = 0;


double last_latitude = 0;
double last_longitude = 0;

double ref_latitude2 = 0;
double ref_longitude2 = 0;

int lte_wait = 0;
int lte_quota = 10;

volatile int position=0;
float lat[5];
float lng[5];
time_t ts[5];

#define HTTP_HOST "plongee.duckdns.org"
#define HTTP_PATH "/targets"
#define HTTP_PATH_LONG "/coords"
#define HTTP_PORT 8545
#define MAX_MTU_SIZE     2000
#define RECV_BUF_SIZE    2048
#define SEND_BUF_SIZE    MAX_MTU_SIZE
#define MAX_DISPLAY_TARGETS 4

static int displayed_targets_count = -1;
static int displayed_heading[MAX_DISPLAY_TARGETS] = { -1, -1, -1, -1 };
static int displayed_distance[MAX_DISPLAY_TARGETS] = { -1, -1, -1, -1 };

void write_line(const struct device *i2c_dev, const char *line, uint8_t x, uint8_t y, int erase);

static void reset_target_value_cache(void)
{
	for (int i = 0; i < MAX_DISPLAY_TARGETS; i++) {
		displayed_heading[i] = -1;
		displayed_distance[i] = -1;
	}
}

static void clear_target_rows(const struct device *i2c_dev, uint8_t base_y)
{
	char blank_row[23];
	memset(blank_row, ' ', sizeof(blank_row) - 1);
	blank_row[sizeof(blank_row) - 1] = '\0';

	for (int row = 0; row < MAX_DISPLAY_TARGETS; row++) {
		uint8_t y = base_y + (row * 8);
		write_line(i2c_dev, blank_row, 0, y, 0);
	}
}

static void draw_target_rows_layout(const struct device *i2c_dev, int count, uint8_t base_y)
{
	uint8_t y = base_y;
	char message[16];

	if (count < 0) {
		count = 0;
	}
	if (count > MAX_DISPLAY_TARGETS) {
		count = MAX_DISPLAY_TARGETS;
	}

	clear_target_rows(i2c_dev, base_y);

	for (int i = 0; i < count; i++) {
		if (y > (SSD1306_HEIGHT - 8)) {
			break;
		}

		snprintf(message, sizeof(message), "%1d:", i + 1);
		write_line(i2c_dev, message, 0, y, 0);
		write_line(i2c_dev, "DEG", 7 * 6, y, 0);
		write_line(i2c_dev, "|", 12 * 6, y, 0);
		write_line(i2c_dev, "M", 20 * 6, y, 0);

		y += 8;
	}

	displayed_targets_count = count;
	reset_target_value_cache();
}

#define JSON_TEMPLATE "%ld,%.9f,%.9f"
#define JSON_TEMPLATE_LONG "%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f,%ld,%.9f,%.9f"

char send_buf[2000];

bool gps_state = 1;
bool lte_state = 0;
time_t timestamp;
volatile float avg = 0;
float thresold = 19;
int reset_threshold = 20;

int refresh_rate = 1000;
int confirmation_rate = 20;

int menu = -1;

enum tap_direction {
	TAP_NONE = 0,
	TAP_UP,
	TAP_DOWN,
	TAP_LEFT,
	TAP_RIGHT,
};

static struct k_mutex tap_mutex;
static volatile enum tap_direction pending_tap = TAP_NONE;
static volatile bool wake_request = false;

/* Tune these values on hardware if needed. */
static float tap_delta_threshold = 1.45f;
static float tap_release_threshold = 0.50f;
static float tap_axis_dominance = 1.30f;
static float tap_direction_margin = 0.40f;
static int tap_direction_window_ms = 20;
static float tap_peak_weight = 0.60f;
static int tap_deadtime_ms = 250;
static int tap_boot_guard_ms = 7000;
static int tap_menu_confirm_guard_ms = 450;

/* Physical mounting orientation mapping. */
static bool top_is_negative_y = true;
static bool left_is_negative_x = true;

const char *menu_str[] = {
    "EXIT MENU",
	"GPS REACTIVATE",
	"RELOAD COORDINATES",
	"FW UPDATE",
	"OFF"
};
int nb_menu = 5;

K_THREAD_STACK_DEFINE(accelerometer_stack, 1024);
K_THREAD_STACK_DEFINE(tap_stack, 1024);
K_THREAD_STACK_DEFINE(gps_stack, 1024);
K_THREAD_STACK_DEFINE(coordinates_stack, 2048);

struct k_thread accelerometer_data;
struct k_thread tap_data;
struct k_thread gps_data;
struct k_thread coordinates_data;

int measure_rate = 10;

float valuex = 0;
float valuey = 0;
float valuez = 0;
volatile float accel_x = 0.0f;
volatile float accel_y = 0.0f;
volatile float accel_z = 0.0f;
volatile float linear_x = 0.0f;
volatile float linear_y = 0.0f;
volatile float linear_z = 0.0f;

int tap_reset_rate = 20;
uint32_t last_fix = 0;
int gps_rate = 500;
volatile int first = 0;
uint32_t ref_lastfix = 0;
uint32_t last_gnss_diag = 0;
volatile bool gnss_display_dirty = true;
static int64_t tap_accept_after_ms;
static int64_t menu_confirm_after_ms;

enum gps_capture_mode {
	GPS_CAPTURE_DORMANT = 0,
	GPS_CAPTURE_REACTIVATING,
	GPS_CAPTURE_ACTIVE,
};

static volatile uint8_t gps_capture_mode = GPS_CAPTURE_REACTIVATING;
static bool active_point_valid;
static double active_point_lat;
static double active_point_lon;
static int64_t last_new_point_ms;
static bool gps_seen_fix_since_reactivate;

#define GPS_NEW_POINT_MIN_DISTANCE_M 8
#define GPS_DORMANT_TIMEOUT_MS 120000

enum startup_stage {
	STARTUP_STAGE_GNSS_WARMUP = 0,
	STARTUP_STAGE_LTE_CONNECT,
	STARTUP_STAGE_DNS,
	STARTUP_STAGE_TCP_CONNECT,
	STARTUP_STAGE_HTTP_REQUEST,
	STARTUP_STAGE_WAIT_SERVER,
	STARTUP_STAGE_PARSE,
	STARTUP_STAGE_READY,
	STARTUP_STAGE_RETRY,
	STARTUP_STAGE_ERROR,
};

static volatile uint8_t startup_stage = STARTUP_STAGE_GNSS_WARMUP;

static const char *startup_stage_text(uint8_t stage)
{
	switch (stage) {
	case STARTUP_STAGE_GNSS_WARMUP:
		return "GNSS WARMUP";
	case STARTUP_STAGE_LTE_CONNECT:
		return "LTE CONNECT";
	case STARTUP_STAGE_DNS:
		return "DNS RESOLVE";
	case STARTUP_STAGE_TCP_CONNECT:
		return "TCP CONNECT";
	case STARTUP_STAGE_HTTP_REQUEST:
		return "HTTP REQUEST";
	case STARTUP_STAGE_WAIT_SERVER:
		return "WAIT SERVER";
	case STARTUP_STAGE_PARSE:
		return "PARSING DATA";
	case STARTUP_STAGE_READY:
		return "READY";
	case STARTUP_STAGE_RETRY:
		return "RETRY 60S";
	default:
		return "NET ERROR";
	}
}





void clear_display(const struct device *i2c_dev) {
	k_mutex_lock(&display_mutex, K_FOREVER);
    // 1. Efface le framebuffer RAM
    memset(framebuffer, 0, sizeof(framebuffer));

    // 2. Pour chaque page, envoie 128 zéros d'un coup
	for (uint8_t page = 0; page < SSD1306_PAGES; page++) {
        ssd1306_write_cmd(i2c_dev, 0x21); // Set column address
        ssd1306_write_cmd(i2c_dev, 0);    // Start column
		ssd1306_write_cmd(i2c_dev, SSD1306_WIDTH - 1);  // End column
        ssd1306_write_cmd(i2c_dev, 0x22); // Set page address
        ssd1306_write_cmd(i2c_dev, page); // Start page
        ssd1306_write_cmd(i2c_dev, page); // End page

        // Envoie 128 octets d'un coup (plus rapide que 128 appels séparés)
        uint8_t buf[129];
        buf[0] = 0x40; // Control byte for data
		memset(&buf[1], 0, SSD1306_WIDTH);
        i2c_write(i2c_dev, buf, sizeof(buf), SSD1306_I2C_ADDR);
    }
	k_mutex_unlock(&display_mutex);
}

