madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	}


	// Flush final pour s'assurer que tout est écrit
	err = flash_img_buffered_write(&fic, NULL, 0, true);
	if (err) {
		printk("Erreur flush final: %d\n", err);
	}

	LOG_WRN("Firmware image written; reboot disabled during diagnostics");
	return;


}

void send_to_cloud(void)
{
	LOG_INF("send_to_cloud: skipped during LTE diagnostics");
}

float sensor_value_to_float(const struct sensor_value *val)
{
    return (float)val->val1 + (val->val2 / 1000000.0f);
}

static void push_tap_event(enum tap_direction dir)
{
	k_mutex_lock(&tap_mutex, K_FOREVER);
	pending_tap = dir;
	wake_request = true;
	k_mutex_unlock(&tap_mutex);
}

static enum tap_direction pop_tap_event(void)
{
	enum tap_direction dir;

	k_mutex_lock(&tap_mutex, K_FOREVER);
	dir = pending_tap;
	pending_tap = TAP_NONE;
	k_mutex_unlock(&tap_mutex);

	return dir;
}

static bool pop_wake_request(void)
{
	bool requested;

	k_mutex_lock(&tap_mutex, K_FOREVER);
	requested = wake_request;
	wake_request = false;
	k_mutex_unlock(&tap_mutex);

	return requested;
}

static enum tap_direction detect_tap_direction(float x, float y)
{
	float adx = fabsf(x);
	float ady = fabsf(y);

	if (adx < tap_delta_threshold && ady < tap_delta_threshold) {
		return TAP_NONE;
	}

	if (fabsf(adx - ady) < tap_direction_margin) {
		return TAP_NONE;
	}

	if (ady >= adx * tap_axis_dominance) {
		if (y < 0.0f) {
			return top_is_negative_y ? TAP_UP : TAP_DOWN;
		}
		return top_is_negative_y ? TAP_DOWN : TAP_UP;
	}

	if (adx >= ady * tap_axis_dominance) {
		if (x < 0.0f) {
			return left_is_negative_x ? TAP_LEFT : TAP_RIGHT;
		}
		return left_is_negative_x ? TAP_RIGHT : TAP_LEFT;
	}

	return TAP_NONE;
}
 
void accelerometer_thread(void *a, void *b, void *c) {

	const struct device *lis2dh = (const struct device *)a;
	float grav_x = 0.0f;
	float grav_y = 0.0f;
	float grav_z = 0.0f;
	bool filter_initialized = false;
	const float grav_alpha = 0.92f;

    while (1) {

		struct sensor_value accel[3];
		if (sensor_sample_fetch(lis2dh) < 0) {
			LOG_INF("Erreur lors de la récupération des données du capteur\n");
			return;
		}

		if (sensor_channel_get(lis2dh, SENSOR_CHAN_ACCEL_XYZ, accel) < 0) {
			LOG_INF("Erreur lors dze la récupération des données du capteur\n");
			return;
		}

		float ax = sensor_value_to_float(&accel[0]);
		float ay = sensor_value_to_float(&accel[1]);
		float az = sensor_value_to_float(&accel[2]);

		if (!filter_initialized) {
			grav_x = ax;
			grav_y = ay;
			grav_z = az;
			filter_initialized = true;
		} else {
			grav_x = (grav_alpha * grav_x) + ((1.0f - grav_alpha) * ax);
			grav_y = (grav_alpha * grav_y) + ((1.0f - grav_alpha) * ay);
			grav_z = (grav_alpha * grav_z) + ((1.0f - grav_alpha) * az);
		}

		float lx = ax - grav_x;
		float ly = ay - grav_y;
		float lz = az - grav_z;


		avg += sqrtf(ax*ax+ay*ay+az*az)-9.8;


		valuex = ax*ax;
		valuey = ay*ay;
		valuez = az*az;
		accel_x = ax;
		accel_y = ay;
		accel_z = az;
		linear_x = lx;
		linear_y = ly;
		linear_z = lz;


		k_sleep(K_MSEC(measure_rate));

    }
}

void tap_thread(void *a, void *b, void *c) {
	ARG_UNUSED(a);
	ARG_UNUSED(b);
	ARG_UNUSED(c);

	bool in_impulse = false;
	int64_t impulse_start_ms = 0;
	float onset_sum_x = 0.0f;
	float onset_sum_y = 0.0f;
	int onset_samples = 0;
	float peak_x = 0.0f;
	float peak_y = 0.0f;
	float peak_plane = 0.0f;
	int64_t next_allowed = 0;

	while (1) {
		float tap_x = linear_x;
		float tap_y = linear_y;
		float plane = sqrtf((tap_x * tap_x) + (tap_y * tap_y));

		int64_t now_ms = k_uptime_get();
		if (!in_impulse) {
			if (now_ms >= next_allowed && plane >= tap_delta_threshold) {
				in_impulse = true;
				impulse_start_ms = now_ms;
				onset_sum_x = tap_x;
				onset_sum_y = tap_y;
				onset_samples = 1;
				peak_x = tap_x;
				peak_y = tap_y;
				peak_plane = plane;
			}
		} else {
			if (plane > peak_plane) {
				peak_plane = plane;
				peak_x = tap_x;
				peak_y = tap_y;
			}

			if ((now_ms - impulse_start_ms) <= tap_direction_window_ms) {
				onset_sum_x += tap_x;
				onset_sum_y += tap_y;
				onset_samples++;
			}

			if (plane <= tap_release_threshold) {
				float onset_x = onset_samples > 0 ? (onset_sum_x / onset_samples) : peak_x;
				float onset_y = onset_samples > 0 ? (onset_sum_y / onset_samples) : peak_y;
				float dir_x = (tap_peak_weight * peak_x) + ((1.0f - tap_peak_weight) * onset_x);
				float dir_y = (tap_peak_weight * peak_y) + ((1.0f - tap_peak_weight) * onset_y);
				enum tap_direction dir = detect_tap_direction(dir_x, dir_y);

			if (dir != TAP_NONE) {
				push_tap_event(dir);
				next_allowed = now_ms + tap_deadtime_ms;
				LOG_INF("Tap dir=%d peak=(%.2f,%.2f) onset=(%.2f,%.2f) amp=%.2f", dir,
					(double)peak_x, (double)peak_y,
					(double)onset_x, (double)onset_y,
					(double)peak_plane);
			}

			in_impulse = false;
			}
		}

		k_sleep(K_MSEC(tap_reset_rate));
	}
}

void gps_thread(void *a, void *b, void *c) {

while(true){

k_mutex_lock(&state.mutex, K_FOREVER);
while(!state.ready) {
	k_condvar_wait(&state.cond, &state.mutex,K_FOREVER);
}
	state.ready = false;
k_mutex_unlock(&state.mutex);


	LOG_INF("GPS");
			int64_t now_ms = k_uptime_get();

			if (gps_capture_mode == GPS_CAPTURE_DORMANT) {
				if (gps_tracking != 0 || gps_using != 0 || gps_unk != 0) {
					gps_tracking = 0;
					gps_using = 0;
					gps_unk = 0;
					gnss_display_dirty = true;
				}
			} else {
				print_satellite_stats(&last_pvt);
			}

			if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
							int heading_tmp = 0;
							int distance_m = 0;

							gnss_has_fix = true;
							if (gps_capture_mode != GPS_CAPTURE_DORMANT) {
								fix_timestamp = now_ms;
								print_fix_data(&last_pvt);
								last_fix = 0;
								gps_seen_fix_since_reactivate = true;
								gnss_display_dirty = true;
							} else if (last_new_point_ms > 0) {
								last_fix = (uint32_t)((now_ms - last_new_point_ms) / 1000);
							}

							if (gps_capture_mode == GPS_CAPTURE_REACTIVATING) {
								active_point_lat = last_latitude;
								active_point_lon = last_longitude;
								active_point_valid = true;
								last_new_point_ms = now_ms;
								gps_capture_mode = GPS_CAPTURE_ACTIVE;
								LOG_INF("GPS capture reactivated: first point acquired");
							} else if (gps_capture_mode == GPS_CAPTURE_ACTIVE) {
								if (!active_point_valid) {
									active_point_lat = last_latitude;
									active_point_lon = last_longitude;
									active_point_valid = true;
									last_new_point_ms = now_ms;
								} else {
									calcul_cap_distance_int(active_point_lat, active_point_lon,
										last_latitude, last_longitude,
										&heading_tmp, &distance_m);
									if (distance_m >= GPS_NEW_POINT_MIN_DISTANCE_M) {
										active_point_lat = last_latitude;
										active_point_lon = last_longitude;
										last_new_point_ms = now_ms;
									}
								}

