madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
							}
							//print_distance_from_reference(&last_pvt);


						} else {
							gnss_has_fix = false;

							last_fix = (uint32_t)((k_uptime_get() - fix_timestamp) / 1000);
							gnss_display_dirty = true;

							if (gps_capture_mode == GPS_CAPTURE_ACTIVE &&
							    gps_seen_fix_since_reactivate &&
							    ((int64_t)last_fix * 1000) >= GPS_DORMANT_TIMEOUT_MS) {
								gps_capture_mode = GPS_CAPTURE_DORMANT;
								gnss_display_dirty = true;
								LOG_INF("GPS capture dormant: signal lost for 2 minutes after at least one fix");
							}

							if ((k_uptime_get_32() - last_gnss_diag) >= 5000U) {
								LOG_WRN("GNSS searching: tracked=%u used=%u unhealthy=%u last_fix=%us antenna=%s",
									gps_tracking,
									gps_using,
									gps_unk,
									last_fix,
									gnss_antenna_mode());
								last_gnss_diag = k_uptime_get_32();
							}

						}

}



}

void exit_menu(const struct device *i2c_dev){

	menu = -1;
	clear_display(i2c_dev);

}

void change_gps(const struct device *i2c_dev){

uint8_t x = 5*6, y = 8;
char message[128];
if(gps_state == 0){
	gps_state = 1;
	snprintf(message, sizeof(message), " ON ");
						}else{
							gps_state = 0;
							snprintf(message, sizeof(message), " OFF");
						}
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,1);
					x += 6;

				}
}

void change_lte(const struct device *i2c_dev){

uint8_t x = 5*6, y = 16;
char message[128];
if(lte_state == 0){
	lte_state = 1;
	snprintf(message, sizeof(message), " ON ");
						}else{
							lte_state = 0;
							snprintf(message, sizeof(message), " OFF");
						}
				for (const char *p = message; *p; p++) {
					dessiner_caractere(i2c_dev, *p, x, y,1);
					x += 6;

				}
}

void reload_coordinates(const struct device *i2c_dev){

	if(lte_state == 0){return;}

	clear_display(i2c_dev);

	uint8_t x = 0, y = 0;
	char line[128];
	snprintf(line,sizeof(line),"INITIALIZATION...");
	write_line(i2c_dev, line, x, y, 0);


	initial_connexion();

	menu = -1;
	first = 0;

}


void coordinates_thread(void *a, void *b, void *c)
{
	ARG_UNUSED(a);
	ARG_UNUSED(b);
	ARG_UNUSED(c);

	/* Give GNSS priority at boot to avoid starving early satellite acquisition. */
	startup_stage = STARTUP_STAGE_GNSS_WARMUP;
	int64_t warmup_deadline = k_uptime_get() + 30000;
	while (!gnss_has_fix && k_uptime_get() < warmup_deadline) {
		k_sleep(K_SECONDS(1));
	}
	LOG_INF("coordinates_thread: GNSS warmup complete (fix=%d), starting LTE fetch", gnss_has_fix ? 1 : 0);

	while (1) {
		k_mutex_lock(&lte_mutex, K_FOREVER);
		startup_stage = STARTUP_STAGE_LTE_CONNECT;
		lte_connect();
		LOG_INF("coordinates_thread: starting coordinates fetch");
		initial_connexion();
		lte_disconnect();
		k_mutex_unlock(&lte_mutex);

		if (targets_count > 0) {
			LOG_INF("coordinates_thread: loaded %d targets", targets_count);
			startup_stage = STARTUP_STAGE_READY;
			break;
		}

		LOG_WRN("coordinates_thread: no targets yet, retrying in 60s");
		startup_stage = STARTUP_STAGE_RETRY;
		k_sleep(K_SECONDS(60));
	}
}
void firmware_update(const struct device *i2c_dev){


if(lte_state == 0){return; }

	clear_display(i2c_dev);


	uint8_t x = 5*6, y = 16;
	

	x=0;
	y=0;

		char line[128];
		snprintf(line,sizeof(line),"Initialization...");
		for (const char *p = line; *p; p++) {
			dessiner_caractere(i2c_dev, *p, x, y,0);
			x += 6;

		}









	flash_firmware();


	menu = -1;
	first = 0;

}

void ssd1306_power_off(const struct device *i2c_dev) {
	k_mutex_lock(&display_mutex, K_FOREVER);
    ssd1306_write_cmd(i2c_dev, 0xAE); // Display OFF
	k_mutex_unlock(&display_mutex);
}

void ssd1306_power_on(const struct device *i2c_dev) {
	k_mutex_lock(&display_mutex, K_FOREVER);
    ssd1306_write_cmd(i2c_dev, 0xAF); // Display ON
	k_mutex_unlock(&display_mutex);
}

void off(const struct device *i2c_dev){
	int err;

	LOG_WRN("Entering deep sleep mode");
	menu = -1;
	first = 0;
	gps_capture_mode = GPS_CAPTURE_DORMANT;
	gps_seen_fix_since_reactivate = false;
	active_point_valid = false;
	last_new_point_ms = 0;
	gnss_display_dirty = true;
	last_tracked = 0xFF;
	last_in_fix = 0xFF;
	last_unhealthy = 0xFF;

	k_mutex_lock(&state.mutex, K_FOREVER);
	state.ready = false;
	k_mutex_unlock(&state.mutex);

	if (nrf_modem_gnss_stop() != 0) {
		LOG_WRN("Failed to stop GNSS before deep sleep");
	}
	lte_disconnect();
	lte_state = 0;

	ssd1306_power_off(i2c_dev);

	while (!pop_wake_request()) {
		k_sleep(K_MSEC(100));
	}

	LOG_WRN("Waking from deep sleep");
	ssd1306_power_on(i2c_dev);
	clear_display(i2c_dev);

	gps_capture_mode = GPS_CAPTURE_REACTIVATING;
	gps_seen_fix_since_reactivate = false;
	active_point_valid = false;
	last_new_point_ms = 0;
	last_fix = 0;
	startup_stage = STARTUP_STAGE_GNSS_WARMUP;
	gnss_display_dirty = true;

	err = gnss_init_and_start();
	if (err != 0) {
		LOG_ERR("Failed to restart GNSS after deep sleep");
	}

	k_mutex_lock(&state.mutex, K_FOREVER);
	state.ready = true;
	k_condvar_broadcast(&state.cond);
	k_mutex_unlock(&state.mutex);

}

void write_line(const struct device *i2c_dev, const char *line, uint8_t x, uint8_t y, int erase) {
	if (y > (SSD1306_HEIGHT - 7)) {
		return;
	}

	int cursor = x;
	for (const char *p = line; *p; p++) {
		if (cursor > (SSD1306_WIDTH - 5)) {
			break;
		}

		dessiner_caractere(i2c_dev, *p, (uint8_t)cursor, y, erase);
		cursor += 6;
	}
}

static void draw_menu_screen(const struct device *i2c_dev)
{
	uint8_t y = 0;
	char message[128];

	clear_display(i2c_dev);

	for (int i = 0; i < nb_menu; i++) {
		snprintf(message, sizeof(message), "%s", menu_str[i]);
		write_line(i2c_dev, message, 6, y, 0);

		y += 8;
	}

	write_line(i2c_dev, ">", 0, menu * 8, 0);
}

static void open_menu(const struct device *i2c_dev)
{
	menu = 0;
	menu_confirm_after_ms = k_uptime_get() + tap_menu_confirm_guard_ms;
	draw_menu_screen(i2c_dev);
}

static void move_menu_cursor(const struct device *i2c_dev, int delta)
{
	char marker[2] = " ";

	write_line(i2c_dev, marker, 0, menu * 8, 1);
	menu = (menu + delta + nb_menu) % nb_menu;
	menu_confirm_after_ms = k_uptime_get() + tap_menu_confirm_guard_ms;
	marker[0] = '>';
	write_line(i2c_dev, marker, 0, menu * 8, 0);
}

static void execute_menu_selection(const struct device *i2c_dev)
{
	LOG_INF("MENU CHOISI: %s", menu_str[menu]);

