madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
	switch (menu) {
	case 0:
		exit_menu(i2c_dev);
		first = 0;
		last_tracked = 0;
		last_fix = 0;
		last_in_fix = 0;
		last_unhealthy = 0;
		last_latitude = 0;
		last_longitude = 0;
		break;
	case 1:
		gps_capture_mode = GPS_CAPTURE_ACTIVE;
		last_new_point_ms = k_uptime_get();
		gps_seen_fix_since_reactivate = false;
		if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
			print_fix_data(&last_pvt);
			active_point_lat = last_latitude;
			active_point_lon = last_longitude;
			active_point_valid = true;
			gps_seen_fix_since_reactivate = true;
			LOG_INF("GPS capture mode set to ACTIVE (instant fix)");
		} else {
			active_point_valid = false;
			LOG_INF("GPS capture mode set to ACTIVE (waiting for first fix)");
		}
		/* Always refresh signal counters immediately when exiting dormant. */
		print_satellite_stats(&last_pvt);
		last_tracked = 0xFF;
		last_in_fix = 0xFF;
		last_unhealthy = 0xFF;
		gnss_display_dirty = true;
		menu = -1;
		first = 0;
		break;
	case 2:
		reload_coordinates(i2c_dev);
		first = 0;
		break;
	case 3:
		LOG_WRN("Firmware update disabled during diagnostics");
		break;
	case 4:
		off(i2c_dev);
		break;
	default:
		break;
	}

	if (menu >= 0) {
		draw_menu_screen(i2c_dev);
	}
}

int main(void)
{

	k_mutex_init(&display_mutex);
	k_mutex_init(&lte_mutex);
	k_mutex_init(&tap_mutex);
	k_mutex_init(&state.mutex);
	k_condvar_init(&state.cond);
	state.ready = false;
	uint8_t x = 0, y = 0;
	char message[128];
	int err;
	bool home_screen_cleared = false;
	uint8_t battery_pct = 0;
	uint8_t displayed_battery_pct = 0xFF;
	uint8_t displayed_startup_stage = 0xFF;
	uint8_t displayed_startup_visible = 0xFF;
	bool battery_valid = false;
	int64_t next_battery_poll_ms = 0;
	tap_accept_after_ms = k_uptime_get() + tap_boot_guard_ms;
	menu_confirm_after_ms = 0;

	//const struct device *i2c_dev = DEVICE_DT_GET(DT_NODELABEL(i2c1));
	if (!device_is_ready(i2c_dev)) {
		LOG_ERR("I2C device not ready");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}
	LOG_INF("I2C device is ready");
	LOG_INF("GNSS antenna mode: %s", gnss_antenna_mode());

	clear_display(i2c_dev); // Efface l'écran avant de dessiner
    ssd1306_init(i2c_dev); // <-- Ajoute cette ligne ici


	snprintf(message, sizeof(message), "%s %s", __DATE__, __TIME__);
	write_line(i2c_dev, message, 0, 0, 1);
	k_sleep(K_MSEC(600));

	clear_display(i2c_dev);
	snprintf(message, sizeof(message), "T: %2d U: %2d UN: %d", 0, 0, 0);
	write_line(i2c_dev, message, 0, 0, 0);
	snprintf(message, sizeof(message), "LAST FIX: %d", 0);
	write_line(i2c_dev, message, 0, 8, 0);
	write_line(i2c_dev, "--%", 18 * 6, 8, 0);
	snprintf(message, sizeof(message), "                ");
	write_line(i2c_dev, message, 0, 32, 0);
	home_screen_cleared = true;
	first = 0;

    const struct device *lis2dh = DEVICE_DT_GET_ONE(st_lis2dh);
    if (!device_is_ready(lis2dh)) {
        LOG_ERR("Erreur : LIS2DH non prêt\n");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
    }

	k_thread_create(&accelerometer_data, accelerometer_stack, 1024,accelerometer_thread, (void *)lis2dh, NULL, NULL,5, 0, K_NO_WAIT);
	k_thread_create(&tap_data, tap_stack, 1024,tap_thread, NULL, NULL, NULL,5, 0, K_NO_WAIT);
	k_thread_create(&gps_data, gps_stack, 1024,gps_thread, NULL, NULL, NULL,5, 0, K_NO_WAIT);


	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("Modem library initialization failed, error: %d", err);
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}

	log_modem_state("After modem init");

	/* Initialize reference coordinates (if used). */
	if (sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE) > 1 &&
	    sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE) > 1) {
		ref_used = true;
		ref_latitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE);
		ref_longitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE);
	}

	if (modem_init() != 0) {
		LOG_ERR("Failed to initialize modem");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}

	if (sample_init() != 0) {
		LOG_ERR("Failed to initialize sample");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}

	if (gnss_init_and_start() != 0) {
		LOG_ERR("Failed to initialize and start GNSS");
		while (true) {
			k_sleep(K_SECONDS(1));
		}
	}

	/* Explicit runtime init: always begin with a fresh GPS reactivation cycle at boot. */
	gps_capture_mode = GPS_CAPTURE_REACTIVATING;
	active_point_valid = false;
	last_new_point_ms = 0;
	gps_seen_fix_since_reactivate = false;
	gnss_display_dirty = true;
	last_tracked = 0xFF;
	last_in_fix = 0xFF;
	last_unhealthy = 0xFF;

	LOG_INF("main: GNSS started, scheduling coordinates thread");
	k_thread_create(&coordinates_data, coordinates_stack, K_THREAD_STACK_SIZEOF(coordinates_stack),
			coordinates_thread, NULL, NULL, NULL, 7, 0, K_NO_WAIT);

	LOG_INF("main: starting initial GNSS phase");
	LOG_INF("GPS capture mode at boot: REACTIVATING");
	fix_timestamp = k_uptime_get();

	while(true){

		int64_t now_ms = k_uptime_get();
		if (now_ms >= next_battery_poll_ms) {
			int battery_mv = 0;

			next_battery_poll_ms = now_ms + 30000;
			if (board_battery_percent_get(&battery_pct, &battery_mv) == 0) {
				battery_valid = true;
				LOG_DBG("Battery(board ADC): %d mV => %u%%", battery_mv, battery_pct);
			} else {
				battery_valid = false;
			}
		}

	if(menu == -1){
		int visible_targets = targets_count;
		int layout_rows;
		bool show_startup_stage = (startup_stage != STARTUP_STAGE_READY) || (targets_count <= 0);
		uint8_t targets_base_y = show_startup_stage ? 32 : 24;
		if (visible_targets > MAX_DISPLAY_TARGETS) {
			visible_targets = MAX_DISPLAY_TARGETS;
		}
		if (visible_targets < 0) {
			visible_targets = 0;
		}
		layout_rows = show_startup_stage ? 0 : visible_targets;

		if (!home_screen_cleared) {
			clear_display(i2c_dev);
			home_screen_cleared = true;
		}

		if(first == 0){
					
			clear_display(i2c_dev);
			snprintf(message, sizeof(message), "T: %2d U: %2d UN: %d", 0, 0, 0);
			write_line(i2c_dev, message, 0, 0, 0);

			snprintf(message, sizeof(message), "LAST FIX: %d",0);
			write_line(i2c_dev, message, 0, 8, 0);
			write_line(i2c_dev, "--%", 18 * 6, 8, 0);
			write_line(i2c_dev, "                     ", 0, 24, 0);
			displayed_battery_pct = 0xFF;
			draw_target_rows_layout(i2c_dev, layout_rows, targets_base_y);


