madubois/nrf9160-feather-examples-and-drivers/samples/kraken_tracker/src/main.c
		}

		if (displayed_targets_count != layout_rows ||
		    displayed_startup_visible != (show_startup_stage ? 1 : 0)) {
			draw_target_rows_layout(i2c_dev, layout_rows, targets_base_y);
			gnss_display_dirty = true;
		}

		if (show_startup_stage) {
			if (displayed_startup_stage != startup_stage || displayed_startup_visible != 1) {
				snprintf(message, sizeof(message), "%s", startup_stage_text(startup_stage));
				write_line(i2c_dev, "                     ", 0, 24, 1);
				write_line(i2c_dev, message, 0, 24, 1);
				displayed_startup_stage = startup_stage;
				displayed_startup_visible = 1;
			}
		} else if (displayed_startup_visible != 0) {
			/* Do not blank y=24 here: this row is reused by target line #1 in READY state. */
			displayed_startup_visible = 0;
			displayed_startup_stage = startup_stage;
			gnss_display_dirty = true;
		}

		if(last_fix != ref_lastfix){
			ref_lastfix = last_fix;
			y=8;
			x=10*6;

			snprintf(message, sizeof(message), "%d   ",last_fix);
			write_line(i2c_dev, message, x,y,1);

		}

		if (!battery_valid) {
			if (displayed_battery_pct != 0xFE) {
				write_line(i2c_dev, "--%", 18 * 6, 8, 1);
				displayed_battery_pct = 0xFE;
			}
		} else if (displayed_battery_pct != battery_pct) {
			snprintf(message, sizeof(message), "%2u%%", battery_pct);
			write_line(i2c_dev, message, 18 * 6, 8, 1);
			displayed_battery_pct = battery_pct;
		}

		if(gps_state == 1 || first == 0){

			first = 1;
			y = 0;

			if (gps_capture_mode == GPS_CAPTURE_DORMANT) {
				x = 3 * 6;
				write_line(i2c_dev, "--", x, y, 1);
				x = 9 * 6;
				write_line(i2c_dev, "--", x, y, 1);
				x = 16 * 6;
				write_line(i2c_dev, "--", x, y, 1);

				/* Force refresh of numeric counters when leaving dormant mode. */
				last_tracked = 0xFF;
				last_in_fix = 0xFF;
				last_unhealthy = 0xFF;
			} else {

			if(last_tracked != gps_tracking){


				x=3*6;

				snprintf(message, sizeof(message), "%2d", gps_tracking);
				write_line(i2c_dev, message,x,y,1);

				last_tracked = gps_tracking;

			}

			if(last_in_fix != gps_using){

				x=9*6;
				snprintf(message, sizeof(message), "%2d", gps_using);

				write_line(i2c_dev,message,x,y,1);


				last_in_fix = gps_using;
			}

			if(last_unhealthy != gps_unk){

			x=16*6;
			snprintf(message, sizeof(message), "%2d", gps_unk);

			write_line(i2c_dev,message,x,y,1);

			last_unhealthy = gps_unk;

			}
			}

			if(lte_state == 1 && gps_using >= 4 && gps_capture_mode == GPS_CAPTURE_ACTIVE){

			if(position >= 5*20){

				position = 0;

				k_mutex_lock(&lte_mutex, K_SECONDS(60));

				send_to_cloud();

				k_mutex_unlock(&lte_mutex);

			}

			if((position+20) % 20 == 0){
				ts[position/20] = timestamp;
				lat[position/20] = active_point_valid ? (float)active_point_lat : (float)last_latitude;
				lng[position/20] = active_point_valid ? (float)active_point_lon : (float)last_longitude;
			}

			position++;



			}

		double calc_latitude = active_point_valid ? active_point_lat : last_latitude;
		double calc_longitude = active_point_valid ? active_point_lon : last_longitude;

		if(!show_startup_stage &&
		   (gnss_display_dirty || fabs(ref_latitude2 - calc_latitude) > 0.00001 || fabs(ref_longitude2 - calc_longitude) > 0.00001)){

			ref_latitude2 = calc_latitude;
			ref_longitude2 = calc_longitude;
			gnss_display_dirty = false;

x = 0;
y = targets_base_y;

for(int i=0;i<visible_targets;i++){

	if (y > (SSD1306_HEIGHT - 8)) {
		break;
	}

	int heading, distance;

	calcul_cap_distance_int(calc_latitude, calc_longitude, targets[i*2], targets[i*2+1], &heading, &distance);

	if(distance > 10000){
		distance = 9999;
	}


	x = 3*6;
	if (displayed_heading[i] != heading) {
		snprintf(message, sizeof(message), "%3d", heading);
		write_line(i2c_dev, message, x, y, 1);
		displayed_heading[i] = heading;
	}

	x = 14*6;
	if (displayed_distance[i] != distance) {
		snprintf(message, sizeof(message), "%4d", distance);
		write_line(i2c_dev, message, x, y, 1);
		displayed_distance[i] = distance;
	}

	y+= 8;
	x = 0;
}

}

		}

		}

		enum tap_direction tap = pop_tap_event();
		if (tap != TAP_NONE) {
			if (k_uptime_get() < tap_accept_after_ms) {
				k_sleep(K_MSEC(100));
				continue;
			}

			if (menu == -1) {
				if (tap == TAP_LEFT || tap == TAP_RIGHT) {
					LOG_INF("GOING IN THE MENU");
					open_menu(i2c_dev);
				}
			} else {
				switch (tap) {
				case TAP_UP:
					/* Haut physique: descendre le curseur dans la liste. */
					move_menu_cursor(i2c_dev, +1);
					break;
				case TAP_DOWN:
					/* Bas physique: remonter le curseur. */
					move_menu_cursor(i2c_dev, -1);
					break;
				case TAP_LEFT:
					/* Gauche physique: confirmer/entrer. */
					if (k_uptime_get() >= menu_confirm_after_ms) {
						execute_menu_selection(i2c_dev);
					}
					break;
				case TAP_RIGHT:
					/* Droite physique: retour page de base. */
					exit_menu(i2c_dev);
					first = 0;
					break;
				default:
					break;
				}
			}
		}

		k_sleep(K_MSEC(100));	

	}

	return 0;
}
